say = 'Hello World!'
print(say)

say_2 = say.upper()
print(say_2)

say_3 = say.capitalize()
print(say_3)

#
# 1. Добавить к алгоритму вычислению среднего балла проверку,
# чтобы оценка была в диапазоне от 1 до 5.
# 2. Вывести оценки студентов за конкретную дату
# (всё что есть, "Введите дату\n", после этого вывести оценку за эту дату)
# 3. Изучить методы строк в Python. Написать пару примеров использования.
